package tool;

public interface Headers {
    String[] departCn = {"编号", "科室名称"};// 科室信息
    String[] unitCn = {"编号", "计量单位"};// 计量单位
    String[] factoryCn = {"编号", "生产厂家"};// 生产厂家
    String[] regTypeCn = {"编号", "挂号类型"};//挂号类型
    String[] feeTypeCn = {"编号", "费用类型"};// 费用类型
    String[] integrateCn = {"会员等级", "消费额度", "折扣"};
    String[] registerCn = {"单据编号", "姓名", "性别", "出生年月", "联系电话", "身份证号", "挂号科室", "医生", "挂号类型","医疗类别", "挂号费", "初诊", "操作员", "时间"};// 挂号信息
    String[] doctorCn = {"姓名", "性别", "出生日期", "身份证号", "联系电话", "联系地址", "科室", "启用"}; // 医生信息
    String[] medicineCn = {"药品名称","药品别名","项目编码", "计量单位", "进价", "售价", "生产厂家", "当前库存", "警告库存", "拼音码", "费用类型", "启用","是否医保","收费等级"}; // 药品信息
    String[] cureCn = {"诊疗名称","诊疗别名","项目编码", "计量单位", "售价", "拼音码", "费用类型", "启用","是否医保","项目等级"}; // 诊疗信息
    String[] inStockCn = {"药品名称", "计量单位", "进价", "入库数量"};// 入库信息
    String[] outStockCn = {"药品名称", "计量单位", "进价", "出库数量"};// 出库信息
    String[] inoutStockCn = {"单据编号", "药品名称",  "进价", "售价", "费用类型", "生产厂家", "出/入库数量", "操作员", "出/入库日期"};//出入库信息
    String[] medCheckerCn = {"药品名称", "计量单位", "进价", "生产厂家", "应余", "实余", "损益数", "损益金额", "费用类型"};// 药品盘点
    String[] chargeDetailCn = {"药品名称", "计量单位", "售价", "数量", "费用类型","项目编码","项目等级","小计"};// 未划价病人收费项目明细
    String[] deMedCn = {"费用名称", "计量单位", "售价", "数量", "费用类型"};// 发药项目明细
    String[] prescriptionCn = {"处方编号","收费单号", "姓名", "处方科室", "处方医生", "日期", "处方金额","处方状态","医嘱"};// 处方信息
    String[] vipCn = {"卡号", "姓名","性别","联系电话","身份证号码","出生日期", "积分", "会员卡状态"};// vip信息
    String[] medSoldCn = {"药品名称", "计量单位", "进价", "售价", "数量", "成本金额", "销售金额", "利润金额"};// 药品销售统计
    String[] cureSoldCn = {"诊疗名称", "计量单位", "售价", "数量", "销售金额"};// 诊疗销售统计
    String[] consumeRecord = {"充值", "消费", "日期"};
    String[] rechargeRecord = {"会员卡号", "充值金额", "赠送金额", "日期"};
    String[] getAndLose = {"药品名称", "售价", "进价", "损益数量", "损益金额", "操作员"};
    String[] datePre = {"处方编号","挂号编号","订单编号","医保流水编号", "姓名", "挂号费", "药品费", "诊疗费", "药品折扣", "诊疗折扣", "会员卡支付", "赠送金额支付", "现金支付", "其他支付","医保支付","医生姓名","科室", "收费日期","挂号日期"};
    String[] patientInfo = {"id","姓名","性别","出生日期","身份证","电话","第一次就诊日期","最后一次就诊日期","历史消费"};
    String[] patientVisit = {"序号","姓名","电话","初诊次数","复诊次数","合计"};
    String[] preList = {"处方id","药品费","诊疗费","剂量"};
}
